{"pages":[{"title":"FSMS 소개","text":"FSMS 무엇인가요?개발자 HEROHJK와 nomore12가 여태껏 진행했던, 앞으로 진행할 스터디를 정리하기 위해 만든 그룹입니다.FSFMS의 뜻은 (Fucking) Funny Study For My Self의 줄임말로, 내 자신을 위한 (빌어먹을) 즐거운 스터디의 약어입니다. FSMS를 만든 이유는 무엇인가요?저는 이 포스트를 작성하는 2022년 기준으로 5년차 iOS 개발자입니다.신입 시절부터 여태껏 매년 2~3회 가량의 스터디를 진행해왔습니다.(nomore12님 또한 스터디를 진행하면서 알게되었습니다 :)) 하지만 최근에 이력서를 작성하면서 깨달은점이.. 여태껏 진행, 참여했던 스터디를 소개할만한 근거가 부족했습니다. 그래서 스터디 Archive의 필요성을 깨닫고 만들게 된 그룹이 바로 FSMS 입니다. FSMS 프로젝트는 제가 은퇴할 때 까지 쭉 제가 참여하거나 진행했었던 스터디를 기록 할 것 입니다. 참여 대상은 누구인가요?FSMS 프로젝트 자체는 저와 nomore12님의 협의로 시작된 프로젝트 이지만, 저나 nomore12님이나 앞으로 항상 같이 같은 스터디에 참여해야하는 것은 아닙니다. 앞으로 각자 계속해서 스터디를 하고, 그것을 FSMS 프로젝트에 아카이브 할 예정인데요, 같이 스터디에 참여하게 되신분도 참여가 가능하며, 이 글을 보고있는 개발자 혹은 개발지망생 모두가 참여 가능합니다. 다만, 참여하시기 전에 저희둘중 한명에게 먼저 연락 주시면 감사하겠습니다 :) 프로젝트에 대한 룰이 있을까요? 😮제약사항과 권장사항을 아래 명시합니다.해당 부분은 언제든지 수정될 수 있습니다. 제약사항 스터디는 1인 이상이 진행하도록 합니다. 스터디 프로젝트의 사이클은 다음과 같습니다. (예정) 모집 OT 스터디 진행 종료 및 회고 하나의 스터디당, 하나의 Repository를 원칙으로 합니다. 모집, OT, 매 진행시, 종료 및 회고 마다 readme 프로젝트에 해당 내용을 정리하여 작성합니다. 참여자는 OT 포스트에 태그로 작성합니다. 인원 변동시 다음과 같은 룰을 따릅니다. 도중 하차하는 인원에 대해서는 OT 포스트에서 삭제합니다. 도중 참여하는 인원에 대해서는 OT 포스트에 추가합니다. 인원 변경에 대한 기록은 OT 이후에도 OT 포스트에서 관리합니다. 스터디 모집 포스트에 반드시 시작일과 종료일, 진행 사이클을 명시합니다. (진행사이클 = 몇 주 동안 스터디를 할 예정인지.) 종료 및 회고 이전에 별다른 사유 없이 1개월 이상 방치된 경우 Repository와 포스트들을 삭제합니다. 권장사항 스터디의 끝이 흐지부지되는 경우는 제가 생각할때 아래의 요인이 가장 큽니다. 스터디장의 역량 부족 계획 설계 부실 스터디원들의 스터디 포기로 인한 운영 불가 따라서 스터디장은 스터디의 시작부터 끝까지 계획, 설계를 최대한 꼼꼼하게 진행하도록 합니다. (여건이 된다면..) 스터디장이 아예 강의를 하는 식으로 리딩을 하는게 가장 최선입니다. 개발자 커리어를 포기하거나, 주 70시간 이상씩 근무하는 환경으로의 변화가 아닌 이상, 바빠서 스터디에서 중도 포기하는것은 핑계입니다. 따라서 꾸준히 참여 가능한 인원들끼리 진행을 합니다. 제약사항의 내용처럼 스터디의 종료일또한 정확하게 작성하여, 최대한 철저하게 지키도록 노력합니다. 그 외 스터디 정확한 진행 방법 및 readme 프로젝트에서의 문서 작성 규칙은 따로 설명하도록 하겠습니다.","link":"/about/index.html"}],"posts":[{"title":"현재까지의 내용 정리","text":"참여자: HEROHJK, KWiOS0101, nomore12 현재까지의 진행상황시작 2022년 4월에 어떤분이 okky에 스터디 모집 공고를 내셨습니다. 5명이 모였고, 3명은 도망갔습니다.. 3명중에 스터디장님이 포함되어 있었습니다.. 포스트 작성자(HEROHJK)인 제가 이어받아 진행하고 있습니다. 중간에 제 권유로 인해 nomore12님이 합류하게 되었습니다. 진행 방식 및 진행 이력 진행 방식은 매주 유동적으로 설정되고 있습니다. 우선은 Swift로 풀이 가능한 Programmers의 레벨1의 모든 문제를 풀어오기로 하였습니다. 한달 조금 넘게 진행중이며, 마무리 단계입니다. (22.04.27 ~ 22.06.05) 첫주에는 3문제, 그 다음주에는 5문제, 그 다음주부터는 10문제를 풀어오기로 했습니다. 하지만 문제점을 한가지 파악하였습니다. 문제점?레벨 2로 넘어가려고 하다보니, 우리는 한가지 문제에 직면하였습니다. 1234코딩테스트를 위한 알고리즘 공부의 핵심은, &quot;최대한 빠른시간에 최대한 정확하게 문제를 풀이하는 것&quot;인데..위 조건을 맞추기 위해서는 문제 유형에 대한 파악이 우선이다.하지만 레벨단위로 문제를 풀다보면, 결국 기본 바탕 없이는 빠르게, 정확하게 해결을 하기가 곤란하다. 이후 진행 방식 이후 (22.06.05~)에는 프로그래머스 문제 풀이를 잠깐 멈추고, 책을 하나 선정하여 공부해오기로 하였습니다. 현재 책은 이것이 취업을 위한 코딩 테스트다. with 파이썬 (나동빈 저) 으로 정해졌습니다. 강사님의 Youtube도 있어서, 굳이 책을 구매하지 않더라도 공부하는데는 문제가 없기도하고, 가장 베스트셀러인 책을 구매하여 공부하기로 협의했습니다. 기간은 최대 2개월로 산정하였습니다. (22.06.05 ~ 22.07.31)","link":"/2022/06/04/AlgorithmStudy2022/AlgorithmStudy2022-2022-06-04/"},{"title":"7주차 내용 정리","text":"금주에는 Programmers 레벨 1 마무리를 하였습니다.[이것이 취업을 위한 코딩 테스트다. with 파이썬 (나동빈 저)] 책도 진행 예정이었으나, 스터디원들의 사정으로 인해 진행하지 못하였습니다.차주에는 위 알고리즘 책을 공부하여 탐욕법과 구현부분을 정리해오려고 합니다. 금주 진행 상황HEROHJK 프로그래머스 레벨 1 알고리즘 마무리. 이것이 취업을 위한 코딩 테스트다 챕터 3, 4 정리 스터디원들이 이번주 진도를 빼지 못했기때문에, 한 주간 보류. KWiOS0101 프로그래머스 레벨 1 알고리즘 마무리. 대외 활동(코딩 테스트 준비)으로 인하여, 알고리즘 책 정리 못함. 차주까지 정리해 오기로 약속. nomore12 프로그래머스 레벨 1 알고리즘 풀이 스터디 준비 부실로 제일 작은 수 제거하기, 최대공약수와 최소공배수 6월 7일 화요일까지 정리 후 PR 하기로 약속. 스터디 준비 부실로 알고리즘 책 정리 못함. 차주까지 정리해오기로 약속. 차주 예정 사항HEROHJK 챕터 5, 6 예습 및 진도차로 인한 한 주 휴식 KWiOS0101 알고리즘 챕터 3, 4 정리 nomore12 알고리즘 챕터 3, 4 정리","link":"/2022/06/07/AlgorithmStudy2022/AlgorithmStudy2022-2022-06-05/"}],"tags":[{"name":"Algorithm","slug":"Algorithm","link":"/tags/Algorithm/"},{"name":"Programmers","slug":"Programmers","link":"/tags/Programmers/"},{"name":"이것이 취업을 위한 코딩 테스트다","slug":"이것이-취업을-위한-코딩-테스트다","link":"/tags/%EC%9D%B4%EA%B2%83%EC%9D%B4-%EC%B7%A8%EC%97%85%EC%9D%84-%EC%9C%84%ED%95%9C-%EC%BD%94%EB%94%A9-%ED%85%8C%EC%8A%A4%ED%8A%B8%EB%8B%A4/"}],"categories":[{"name":"AlgorithmStudy2022","slug":"AlgorithmStudy2022","link":"/categories/AlgorithmStudy2022/"}]}